{
  "Section 1.1: Propositional logic": "Every mathematical proof is written in the context of certain assumptions being made,\nand certain goals to be achieved.\n•Assumptions are the propositions which are known to be true, or which we are as-\nsuming to be true for the purposes of proving something. They include theorems\nthat have already been proved, prior knowledge which is assumed of the reader, and\nassumptions which are explicitly made using words like ‘suppose’ or ‘assume’.\n•Goals are the propositions we are trying to prove in order to complete the proof of a\nresult, or perhaps just a step in the proof.\nWith every phrase we write, our assumptions and goals change. This is perhaps best\nillustrated by example. In Example 1.1.1 below, we will examine the proof of Proposi-\ntion 0.16 in detail, so that we can see how the words we wrote affected the assumptions\nand goals at each stage in the proof. We will indicate our assumptions and goals at\nany given stage using tables—the assumptions listed will only be those assumptions\nwhich are made explicitly; prior knowledge and previously proved theorems will be\nleft implicit.\n✐Example 1.1.1\nThe statement of Proposition 0.16 was as follows:\nLeta,b,c∈Z. Ifcdivides bandbdivides a, then cdivides a.\nThe set-up of the proposition instantly gives us our initial assumptions and goals:\nAssumptions Goals\na,b,c∈ZIfcdivides bandbdivides a, then c\ndivides a\nWe will now proceed through the proof, line by line, to see what effect the words we\nwrote had on the assumptions and goals.\nSince our goal was an expression of the form ‘if. . . then. . . ’, it made sense to start by\nassuming the ‘if’ statement, and using that assumption to prove the ‘then’ statement.\nAs such, the first thing we wrote in our proof was:\nSuppose that cdivides bandbdivides a.\n26\nSection 1.1. Propositional logic 27\nOur updated assumptions and goals are reflected in the following table.\nAssumptions Goals\na,b,c∈Z cdivides a\ncdivides b\nbdivides a\nOur next step in the proof was to unpack the definitions of ‘ cdivides b’ and ‘ bdivides\na’, giving us more to work with.\nSuppose that cdivides bandbdivides a. By Definition 0.13, it follows that\nb=qc and a=rb\nfor some integers qandr.\nThis introduces two new variables q,rand allows us to replace the assumptions ‘ c\ndivides b’ and ‘ bdivides a’ with their definitions.\nAssumptions Goals\na,b,c,q,r∈Z cdivides a\nb=qc\na=rb\nAt this point we have pretty much exhausted all of the assumptions we can make, and\nso our attention turns towards the goal—that is, we must prove that cdivides a. At this\npoint, it helps to ‘work backwards’ by unpacking the goal: what does it mean for cto\ndivide a? Well, by Definition 0.13, we need to prove that ais equal to some integer\nmultiplied by c—this will be reflected in the following table of assumptions and goals.\nSince we are now trying to express ain terms of c, it makes sense to use the equations\nwe have relating awith b, and bwith c, to relate awith c.\nSuppose that cdivides bandbdivides a. By Definition 0.13, it follows tha",
   "Section 1.2: Variables and quantifiers": "Free and bound variables\nEverything we did in Section 1.1 concerned propositions and the logical rules con-\ncerning their proofs. Unfortunately if all we have to work with is propositions then\nour ability to do mathematical reasoning will be halted pretty quickly. For example,\nconsider the following statement:\nxis divisible by 7\nThis statement seems like the kind of thing we should probably be able to work with if\nwe’re doing mathematics. It makes sense if xis a integer, such as 28 or 41; but it doesn’t\nmake sense at all if xis a parrot called Alex.[a]In any case, even when it does make\nsense, its truth value depends on x; indeed, ‘28 is divisible by 7’ is a true proposition,\nbut ‘41 is divisible by 7’ is a false proposition.\nThis means that the statement ‘ xis divisible by 7’ isn’t a proposition— quel horreur !\nBut it almost is a proposition: if we know that xrefers somehow to an integer, then it\nbecomes a proposition as soon as a particular numerical value of xis specified. The\nsymbol xis called a free variable .\n✦Definition 1.2.1\nLetxbe a variable that is understood to refer to an element of a set X. In a statement\ninvolving x, we say xisfree if it makes sense to substitute particular elements of Xin\nthe statement; otherwise, we say xisbound .\nTo represent statements that have free variables in them abstractly, we generalise the\nnotion of a propositional variable (Definition 1.1.2) to that of a predicate .\n✦Definition 1.2.2\nApredicate is a symbol ptogether with a specified list of free variables x1,x2,..., xn\n(where n∈N) and, for each free variable xi, a specification of a set Xicalled the domain\nof discourse (orrange ) ofxi. We will typically write p(x1,x2,..., xn)in order to make\nthe variables explicit.\n[a]Alex the parrot is the only non-human animal to have ever been observed to ask an existential question;\nhe died in September 2007 so we may never know if he was divisible by 7, but it is unlikely. According\ntoTime , his last words were ‘you be good, see you tomorrow, I love you’. The reader is advised to finish\ncrying before they continue reading about variables and quantifiers.\n49\n50 Chapter 1. Logical structure\nThe statements represented by predicates are those that become propositions when spe-\ncific values are substituted for their free variables from their respective domains of\ndiscourse. For example, ‘ xis divisible by 7’ is not a proposition, but it becomes a\nproposition when specific integers (such as 28 or 41) are substituted for x.\nThis is a lot to take in, so let’s look at some examples.\n✐Example 1.2.3\n(i) We can represent the statement ‘ xis divisible by 7’ discussed above by a predicate\np(x)whose only free variable xhasZas its domain of discourse. Then p(28)is\nthe true proposition ‘28 is divisible by 7’ and p(41)is the false proposition ‘41 is\ndivisible by 7’.\n(ii) A predicate with no free variables is precisely a propositional variable. This\nmeans that the notion of a predicate generalises that of a propositional variable.\n(i",
   "Section 1.3: Logical equivalence": "1.3.2 Two logical formulae are logically equivalent (written ≡) if each can be derived\nfrom the other.\n1.3.7 The truth table of a propositional formula is a tabulation of its truth values\nunder all assignments of truth values to its constituent propositional variables.\nTwo propositional formulae are logically equivalent if and only if they have\nidentical columns in a truth table.\nSome specific logical equivalences\n1.3.15 The double-negation of a proposition is equivalent to the original proposition.\nThis gives rise to ‘indirect’ proof by contradiction: in order to prove that a\nproposition pistrue, assume pis false and derive a contradiction.\n1.3.18 The contrapositive of an implication p⇒qis the implication (¬q)⇒(¬p).\nEvery implication is equivalent to its contrapositive, so in order to prove p⇒q,\nit suffices to assume that qis false, and derive that pis false.\n1.3.24 De Morgan’s laws for logical operators say that ¬(p∧q)≡(¬p)∨(¬q)and\n¬(p∨q)≡(¬p)∧(¬q).\n1.3.27 The negation of p⇒qis logically equivalent to p∧(¬q), so in order to prove\nthatp⇒qisfalse , it suffices to prove that pis true but qis false.\n1.3.28 De Morgan’s laws for quantifiers say that ¬∀x∈X,p(x)≡ ∃x∈X,¬p(x)and\n¬∃x∈X,p(x)≡ ∀x∈X,¬p(x). The first of these suggests the strategy of\nproof by counterexample .\nMaximal negation\n1.3.32 A logical formula is maximally negated if it contains no negation operators\n(except, perhaps, immediately before a propositional variable or predicate).\n1.3.35 Every logical formula built using the logical operators and quantifiers in this\nsection is logically equivalent to a maximally negated one.\n79\n80 Chapter 1. Logical structure\nTautologies\n1.3.39 A tautology is a logical formula that is true no matter what assignment of truth\nvalues is given to its constituent propositional variables or what values are sub-\nstituted for its free variables. Tautologies can be invoked as assumptions at any\npoint in a proof.\n1.3.44 A proposition pcan be derived from a proposition qif and only if p⇒qis a\ntautology; and p≡qif and only if p⇔qis a tautology.\n80\nSection 1.E. Chapter 1 exercises 81\nSection 1.E\nChapter 1 exercises\n1.1. For fixed n∈N, let prepresent the proposition ‘ nis even’, let qrepresent the\nproposition ‘ nis prime’ and let rrepresent the proposition ‘ n=2’. For each of the\nfollowing propositional formulae, translate it into plain English and determine whether\nit is true for all n∈N, true for some values of nand false for some values of n, or false\nfor all n∈N.\n(a)(p∧q)⇒r\n(b)q∧(¬r)⇒(¬p)\n(c)((¬p)∨(¬q))∨(¬r)\n(d)(p∧q)∧(¬r)\n1.2. For each of the following plain English statements, translate it into a symbolic\npropositional formula. The propositional variables in your formulae should represent\nthe simplest propositions that they can.\n(a) Guinea pigs are quiet, but they’re loud when they’re hungry.\n(b) It doesn’t matter that 2 is even, it’s still a prime number.\n(c)√\n2 can’t be an integer because it is an irrational number.\n1.3. Letpandqbe propositions, and assume that p⇒",
  "Section 2.1: Sets": "We begin by redefining the notion of a setwith a notch more precision than we provided\nin Chapter 0. At their core, sets seem extremely simple—sets are just collections of\nobjects—except that if not kept in check, this characterisation of a set leads to logical\ninconsistencies, such as the infamous Russell’s paradox .\nThese logical paradoxes can be overcome by restricting ourselves to working inside a\nuniverse U, which we consider to be a set which is so big that it contains all of the\nmathematical objects that we want to talk about. This is a subtle issue, which is well\nbeyond the scope of this section, but is discussed further in Section B.1.\n✦Definition 2.1.1\nAsetis a collection of elements from a specified universe of discourse . The collection\nof everything in the universe of discourse is called the universal set , denoted by U\n(LATEX code:\\mathcal{U} ).\nThe expression x∈X(LATEX code:\\in) denotes the statement that xis an element of\nX; we write x̸∈X(LATEX code:\\not\\in ) to mean ¬(x∈X), that is that xis not an\nelement of X.\n✐Example 2.1.2\nIn Chapter 0, we introduced five sets: the set Nof natural numbers, the set Zof integers,\nthe set Qof rational numbers, the set Rof real numbers and the set Cof complex\nnumbers. ◁\n✎Exercise 2.1.3\nWhich of the following propositions are true, and which are false?\n1\n2∈Z1\n2∈Q Z ∈Q Z ∈U1\n2∈U\n◁\nWe will avoid referring explicitly to the universal set Uwhenever possible, but it will\nalways be there in the background. This is convenient because we no longer need to\nworry about the domain of discourse of free variables (as we did in Definition 1.2.2), so\nthat we can abbreviate ‘ ∀x∈U,p(x)’ by ‘∀x,p(x)’, and ‘ ∃x∈U,p(x)’ by ‘∃x,p(x)’.\nNote that under this convention:\n•∀x∈X,p(x)is logically equivalent to ∀x,(x∈X⇒p(x)); and\n•∃x∈X,p(x)is logically equivalent to ∃x,(x∈X∧p(x)).\n86\nSection 2.1. Sets 87\nSpecifying a set\nOne way of defining a set is simply to describe it in words, like we have done up to\nnow. There are other, more concise ways of specifying sets, which also remove such\nambiguity from the process.\nLists. One way is simply to provide a listof the elements of the set. To specify that\nthe list denotes a set, we enclose the list with {curly brackets }(LATEX code:\\{,\\} ).\nFor example, the following is a specification of a set X, whose elements are the natural\nnumbers between 0 and 5 (inclusive):\nX={0,1,2,3,4,5}\nImplied lists. Sometimes a list might be too long to write out—maybe even infinite—or\nthe length of the list might depend on a variable. In these cases it will be convenient to\nuse an implied list , in which some elements of the list are written, and the rest are left\nimplicit by writing an ellipsis ‘ ...’ (LATEX code:\\dots ). For example, the statement\nX={1,4,9,..., n2}\nmeans that Xis the set whose elements are all the square numbers from 1 to n2, where n\nis some number. Implied lists can be ambiguous, since they rely on the reader’s ability\nto infer the pattern being followed, so use with caution!\nSet-buil",
   "Section 2.2: Set operations": "In Example 2.1.24 we noted that [0,∞)is the set of all non-negative real numbers. What\nif we wanted to talk about the set of all non-negative rational numbers instead? It would\nbe nice if there was some expression in terms of [0,∞)andQto denote this set.\nThis is where set operations come in—they allow us to use previously defined sets to\nintroduce new sets.\nIntersection ( ∩)\nTheintersection of two sets is the set of things which are elements of both sets.\n✦Definition 2.2.1\nLetXandYbe sets. The ( pairwise )intersection ofXandY, denoted X∩Y(LATEX\ncode:\\cap ), is defined by\nX∩Y={a|a∈X∧a∈Y}\n✐Example 2.2.2\nBy definition of intersection, we have x∈[0,∞)∩Qif and only if x∈[0,∞)andx∈Q.\nSince x∈[0,∞)if and only if xis a non-negative real number (see Example 2.1.24), it\nfollows that [0,∞)∩Qis the set of all non-negative rational numbers. ◁\n✎Exercise 2.2.3\nProve that [0,∞)∩Z=N. ◁\n✎Exercise 2.2.4\nWrite down the elements of the set\n{0,1,4,7}∩{ 1,2,3,4,5}\n◁\n✎Exercise 2.2.5\nExpress [−2,5)∩[4,7)as a single interval. ◁\n✣Proposition 2.2.6\nLetXandYbe sets. Prove that X⊆Yif and only if X∩Y=X.\nProof\nSuppose that X⊆Y. We prove X∩Y=Xby double containment.\n98\nSection 2.2. Set operations 99\n• (⊆) Suppose a∈X∩Y. Then a∈Xanda∈Yby definition of intersection, so in\nparticular we have a∈X.\n• (⊇) Suppose a∈X. Then a∈Ysince X⊆Y, so that a∈X∩Yby definition of\nintersection.\nConversely, suppose that X∩Y=X. To prove that X⊆Y, leta∈X. Then a∈X∩Y\nsince X=X∩Y, so that a∈Yby definition of intersection, as required. □\n✎Exercise 2.2.7\nLetXbe a set. Prove that X∩∅=∅. ◁\n✦Definition 2.2.8\nLetXandYbe sets. We say XandYaredisjoint ifX∩Yis empty.\n✐Example 2.2.9\nThe sets {0,2,4}and{1,3,5}are disjoint, since they have no elements in common. ◁\n✎Exercise 2.2.10\nLeta,b,c,d∈Rwith a<bandc<d. Prove that the open intervals (a,b)and(c,d)\nare disjoint if and only if b<cord<a. ◁\nUnion ( ∪)\nTheunion of two sets is the set of things which are elements of at least one of the sets.\n✦Definition 2.2.11\nLetXandYbe sets. The ( pairwise )union ofXandY, denoted X∪Y(LATEX code:\n\\cup ), is defined by\nX∪Y={a|a∈X∨a∈Y}\n✐Example 2.2.12\nLetEbe the set of even integers and Obe the set of odd integers. Since every integer\nis either even or odd, E∪O=Z. Note that E∩O=∅, thus{E,O}is an example of a\npartition ofZ—see Definition 5.2.21. ◁\n✎Exercise 2.2.13\nWrite down the elements of the set\n{0,1,4,7}∪{ 1,2,3,4,5}\n◁\n✎Exercise 2.2.14\nExpress [−2,5)∪[4,7)as a single interval. ◁\n99\n100 Chapter 2. Sets\nThe union operation allows us to define the following class of sets that will be particu-\nlarly useful for us when studying counting principles in Section 8.1.\n✎Exercise 2.2.15\nLetXandYbe sets. Prove that X⊆Yif and only if X∪Y=Y. ◁\n✐Example 2.2.16\nLetX,Y,Zbe sets. We prove that X∩(Y∪Z) = ( X∩Y)∪(X∩Z).\n• (⊆) Let x∈X∩(Y∪Z). Then x∈X, and either x∈Yorx∈Z. Ifx∈Ythen x∈X∩Y,\nand if x∈Zthen x∈X∩Z. In either case, we have x∈(X∩Y)∪(X∩Z).\n• (⊇) Let x∈(X∩Y)∪(X∩Z). Then either x∈X∩Yorx∈X∩Z. In both cases we\nhave x∈Xby definition of intersection In ",
   "Section 3.1: Functions": "One way of studying interactions between sets is by studying functions between them,\nwhich we will define informally in Definition 3.1.1. Functions are mathematical objects\nwhich assign to each element of one set exactly one element of another. Almost every\nbranch of mathematics studies functions, be it directly or indirectly, and almost every\napplication of mathematics arises from a translation of the abstract notion of a function\nto the real world. Just one example of this is the theory of computation—functions\nprovide precisely the language necessary to describe the deterministic input-output be-\nhaviour of algorithms.\nYou might have come across the notion of a function before now. In schools, functions\nare often introduced as being like machines —they have inputs and outputs, and on a\ngiven input they always return the same output. For instance, there is a function which\ntakes integers as inputs and gives integers as outputs, which on the input xreturns the\ninteger x+3.\nThis characterisation of functions, however, is clearly not precise enough for the pur-\nposes of mathematical proof. A next approximation to a precise definition of a function\nmight look something like this:\n✦Definition 3.1.1\nAfunction ffrom a set Xto a set Yis a specification of elements f(x)∈Yforx∈X,\nsuch that\n∀x∈X,∃!y∈Y,y=f(x)\nGiven x∈X, the (unique!) element f(x)∈Yis called the value offatx.\nThe set Xis called the domain (orsource ) of f, and Yis called the codomain (or\ntarget ) off. We write f:X→Y(LATEX code:f : X \\to Y ) to denote the assertion\nthat fis a function with domain Xand codomain Y.\nThis is better—we’re now talking about sets, and not mysterious ‘machines’.\nMoreover, this definition establishes a close relationship between functions and the ∃!\nquantifier: indeed, to say that fassigns to each element of Xa unique element of Yis\nto say precisely that\n∀x∈X,∃!y∈Y,y=f(x)\nConversely, any true proposition of the form ∀x∈X,∃!y∈Y,p(x,y)defines a function\n114\nSection 3.1. Functions 115\nf:X→Y: the function fassigns to each x∈Xthe unique y∈Ysuch that p(x,y)is\ntrue. In other words, ∀x∈X,p(x,f(x))is true!\nWe can use this to generate some examples of functions.\n✐Example 3.1.2\nExample 1.2.27 said that every positive real number has a unique positive square\nroot; we proved this in Example 1.2.30. What this means is that there is a function\nr:(0,∞)→(0,∞)defined by letting r(x)be the (unique) positive square root of x, for\neach x∈(0,∞). That is, we have a function rdefined by r(x) =√x. ◁\n✎Exercise 3.1.3\nRecall Exercise 1.2.31. Which of the statements (a), (b) or (c) is of the form\n∀x∈X,∃!y∈Y,p(x,y)? For each statement of this form, determine the domain and\ncodomain of the corresponding function, and write an expression defining this func-\ntion. ◁\nSpecifying a function\nJust like with sets, there are many ways to specify a function f:X→Y, but when we\ndo so, we must be careful that what we write really does define a function!\nThis correctness of specification is known as well-define",
   "Section 3.2: Injections and surjections": "To motivate some of the definitions to come, look at the dots ( •) and stars ( ⋆) below.\nAre there more dots or more stars?\n•••••••••••••••••••\n⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆\nPause for a second and think about how you knew the answer to this question.\nIndeed, there are more dots than stars. There are a couple of ways to arrive at this\nconclusion:\n(i) You could count the number of dots, count the number of stars, and then compare\nthe two numbers; or\n(ii) You could notice that the dots and the stars are evenly spaced, but that the line of\ndots is longer than the line of stars.\nIt is likely that you chose method (ii). In fact, it is likely that you haven’t even counted\nthe number of dots or the number of stars yet—and you don’t need to! We can conclude\nthat there are more dots than stars by simply pairing up dots with stars—we eventually\nrun out of stars, and there are still dots left over, so there must have been more dots than\nstars.\nInjectivity\nOne way of formalising this act of pairing up stars with dots mathematically is to define\na function f:S→Dfrom the set Sof stars to the set Dof dots, where the value of fat\neach star is the dot that it is paired with. We of course must do this in such a way that\neach dot is paired with at most one star:\n•••••••••••••••••••\n⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆\n130\nSection 3.2. Injections and surjections 131\nIt is a property of this function—called injectivity —that allows us to deduce that there\nare more dots than stars.\nIntuitively, a function f:X→Yis injective if it puts the elements of Xin one-to-one\ncorrespondence with the elements of a subset of Y—just like how the stars are in one-\nto-one correspondence with a subset of the dots in the example above.\n✦Definition 3.2.1\nA function f:X→Yisinjective (orone-to-one ) if\n∀a,b∈X,f(a) =f(b)⇒a=b\nAn injective function is said to be an injection .\n❖Strategy 3.2.2 (Proving a function is injective)\nIn order to prove that a function f:X→Yis injective, it suffices to fix a,b∈X, assume\nthat f(a) =f(b), and then derive a=b.\nBy contraposition, f:X→Ybeing injective is equivalent to saying, for all a,b∈X,\nifa̸=b, then f(a)̸=f(b). This is usually less useful for proving that a function is\ninjective, but it does provide a good intuition—it says that fsends distinct inputs to\ndistinct outputs.\nThe following is a very simple example from elementary arithmetic:\n✐Example 3.2.3\nDefine f:Z→Zby letting f(x) =2n+1 for all n∈Z. We’ll prove that fis injective.\nFixm,n∈Z, and assume that f(m) =f(n). By definition of f, we have 2 m+1=2n+1.\nSubtracting 1 yields 2 m=2n, and dividing by 2 yields m=n. Hence fis injective. ◁\nThe following example is slightly more sophisticated.\n✣Proposition 3.2.4\nLetf:X→Yandg:Y→Zbe functions. If fandgare injective, then g◦fis injective.\nProof\nSuppose that fandgare injective and let a,b∈X. We need to prove that\n(g◦f)(a) = ( g◦f)(b)⇒ a=b\nSo assume (g◦f)(a) = ( g◦f)(b). By definition of function composition, this implies\nthatg(f(a)) = g(f(b)). By injectivity of g, we have f(a) =f(b); and by injec",
   "Section 4.1: Peano axioms": "The purpose of this section is to forget everything we think we know about the nat-\nural numbers, and reconstruct our former knowledge (and more!) using the following\nfundamental property:\nEvery natural number can be obtained in a unique way by\nstarting from zero and adding one some finite number of times.\nThis is slightly imprecise—it is not clear what is meant by ‘adding one some finite\nnumber of times’, for example. Worse still, we are going to define what ‘finite’ means\nin terms of natural numbers in Section 6.1, so we’d better not refer to finiteness in our\ndefinition of natural numbers!\nThe following definition captures precisely the properties that we need in order to char-\nacterise the idea of Nthat we have in our minds. To begin with, Nshould be a set.\nWhatever the elements of this set Nactually are, we will think about them as being\nnatural numbers. One of the elements, in particular, should play the role of the natural\nnumber 0—this will be the zero element z ∈N; and there should be a notion of ‘adding\none’—this will be the successor function s :N→N. Thus given an element n∈N,\nthough of as a natural number, we think about the element s(n)as the natural number\n‘n+1’. Note that this is strictly for the purposes of intuition: we will define ‘ +’ and\n‘1’ in terms of zands, not vice versa.\n✦Definition 4.1.1\nAnotion of natural numbers is a set N, together with an element z∈N, called a zero\nelement , and a function s:N→Ncalled a successor function , satisfying the following\nproperties:\n(i)z̸∈s[N]; that is, z̸=s(n)for any n∈N.\n(ii)sis injective; that is, for all m,n∈N, ifs(m) =s(n), then m=n.\n(iii)Nis generated by zands; that is, for all sets X, ifz∈Xand for all n∈Nwe have\nn∈X⇒s(n)∈X, thenN⊆X.\nThe properties (i), (ii) and (iii) are called Peano’s axioms .\nNote that Definition 4.1.1 does not specify what N,zandsactually are; it just specifies\nthe properties that they must satisfy. It turns out that it doesn’t really matter what notion\n152\nSection 4.1. Peano’s axioms 153\nof natural numbers we use, since any two notions are essentially the same. We will not\nworry about the specifics here—that task is left to Section B.2: a particular notion of\nnatural numbers is defined in Construction B.2.5, and the fact that all notions of natural\nnumbers are ‘essentially the same’ is made precise and proved in Theorem B.2.8.\nWe can define all the concepts involving natural numbers that we are familiar with, and\nprove all the properties that we take for granted, just from the element z∈Nand the\nsuccessor function s:N→N.\nFor instance, we define ‘0’ to mean z, define ‘1’ to mean s(z), define ‘2’ to mean s(s(z)),\nand so on. Thus ‘12’ is defined to mean\ns(s(s(s(s(s(s(s(s(s(s(s(z))))))))))))\nFrom now on, then, let’s write 0 instead of zfor the zero element of N. It would be nice\nif we could write ‘ n+1’ instead of s(n), but we must first define what ‘ +’ means. In\norder to do this, we need a way of defining expressions involving natural numbers; this\nis what the rec",
  "Section 4.2: Weak induction": "Just as recursion exploited the structure of the natural numbers to define expressions\ninvolving natural numbers, induction exploits the very same structure to prove results\nabout natural numbers.\n✣Theorem 4.2.1 (Weak induction principle)\nLetp(n)be logical formula with free variable n∈N, and let n0∈N. If\n(i)p(n0)is true; and\n(ii) For all n⩾n0, ifp(n)is true, then p(n+1)is true;\nthen p(n)is true for all n⩾n0.\nProof\nDefine X={n∈N|p(n0+n)is true}; that is, given a natural number n, we have n∈X\nif and only if p(n0+n)is true. Then\n• 0∈X, since n0+0=n0andp(n0)is true by (i).\n• Let n∈Nand assume n∈X. Then p(n0+n)is true. Since n0+n⩾n0andp(n0+n)\nis true, we have p(n0+n+1)is true by (ii). But then n+1∈X.\nSo by Definition 4.1.1(iii) we have N⊆X. Hence p(n0+n)is true for all n∈N. But\nthis is equivalent to saying that p(n)is true for all n⩾n0. □\n❖Strategy 4.2.2 (Proof by (weak) induction)\nIn order to prove a proposition of the form ∀n⩾n0,p(n), it suffices to prove that:\n•p(n0)is true; and\n• For all n⩾n0, ifp(n)is true, then p(n+1)is true.\nSome terminology has evolved for proofs by induction:\n• The proof of p(n0)is called the base case ;\n• The proof of ∀n⩾n0,(p(n)⇒p(n+1))is called the induction step ;\n• In the induction step, the assumption p(n)is called the induction hypothesis ;\n• In the induction step, the proposition p(n+1)is called the induction goal .\n159\n160 Chapter 4. Mathematical induction\nThe following diagram illustrates the weak induction principle.\nn0 n0+1 ··· n−1 n n+1\nTo interpret this diagram:\n• The shaded diamond represents the base case p(n0);\n• The square represents the induction hypothesis p(n);\n• The dashed circle represents the induction goal p(n+1);\n• The arrow represents the implication we must prove in the induction step.\nWe will use analogous diagrams to illustrate the other induction principles in this sec-\ntion.\n✣Proposition 4.2.3\nLetn∈N. Thenn\n∑\nk=1k=n(n+1)\n2\nProof\nWe proceed by induction on n⩾0.\n• (Base case ) We need to prove0\n∑\nk=1k=0(0+1)\n2.\nThis is true, since0(0+1)\n2=0, and0\n∑\nk=1k=0 by Definition 4.1.10.\n• (Induction step ) Let n⩾0 and suppose thatn\n∑\nk=1k=n(n+1)\n2; this is the induction\nhypothesis.\nWe need to prove thatn+1\n∑\nk=1k=(n+1)(n+2)\n2; this is the induction goal.\n160\nSection 4.2. Weak induction 161\nWe proceed by calculation:\nn+1\n∑\nk=1k= \nn\n∑\nk=1k!\n+(n+1) by Definition 4.1.10\n=n(n+1)\n2+(n+1) by induction hypothesis\n= (n+1)\u0010n\n2+1\u0011\nfactorising\n=(n+1)(n+2)\n2rearranging\nThe result follows by induction. □\nBefore moving on, let’s reflect on the proof of Proposition 4.2.3 to highlight some\neffective ways of writing a proof by induction.\n• We began the proof by indicating that it was a proof by induction. While it is clear in\nthis section that most proofs will be by induction, that will not always be the case, so\nit is good practice to indicate the proof strategy at hand.\n• The base case and induction step are clearly labelled in the proof. This is not strictly\nnecessary from a mathematical perspective, but it helps the rea",
   "Section 4.3: Strong induction": "Consider the following example, which we will attempt to prove by induction.\n✐Example 4.3.1\nDefine a sequence recursively by\nb0=1 and bn+1=1+n\n∑\nk=0bkfor all n∈N\nWe will attempt to prove by induction that bn=2nfor all n∈N.\n• (Base case ) By definition of the sequence we have b0=1=20. So far so good.\n• (Induction step ) Fix n∈N, and suppose that bn=2n. We need to show that bn+1=\n2n+1.\nWell, bn+1=1+n\n∑\nk=0bk=...uh oh.\nHere’s what went wrong. If we could replace each bkby 2kin the sum, then we’d be\nable to complete the proof. However we cannot justify this substitution: our induction\nhypothesis only gives us information about bn, not about a general term bkfork<n.◁\nThe strong induction principle looks much like the weak induction principle, except\nthat its induction hypothesis is more powerful. Despite its name, strong induction is no\nstronger than weak induction; the two principles are equivalent. In fact, we’ll prove the\nstrong induction principle by weak induction !\n✣Theorem 4.3.2 (Strong induction principle)\nLetp(n)be a logical formula with free variable n∈Nand let n0∈N. If\n(i)p(n0)is true; and\n(ii) For all n⩾n0, ifp(k)is true for all n0⩽k⩽n, then p(n+1)is true;\nthen p(n)is true for all n⩾n0.\nProof\nFor each n⩾n0, letq(n)be the assertion that p(k)is true for all n0⩽k⩽n.\nNotice that q(n)implies p(n)for all n⩾n0, since given n⩾n0, ifp(k)is true for all\nn0⩽k⩽n, then in particular p(k)is true when k=n.\n174\nSection 4.3. Strong induction 175\nSo it suffices to prove q(n)is true for all n⩾n0. We do so by weak induction.\n• (Base case )q(n0)is equivalent to p(n0), since the only natural number kwith n0⩽\nk⩽n0isn0itself; hence q(n0)is true by condition (i).\n• (Induction step ) Let n⩾n0and suppose q(n)is true. Then p(k)is true for all n0⩽\nk⩽n.\nWe need to prove that q(n+1)is true—that is, that p(k)is true for all n0⩽k⩽n+1.\nBut we know p(k)is true for all n0⩽k⩽n—this is the induction hypothesis—and\nthen p(n+1)is true by condition (ii). So we have that p(k)is true for all n0⩽k⩽\nn+1 after all.\nBy induction, q(n)is true for all n⩾n0. Hence p(n)is true for all n⩾n0. □\n❖Strategy 4.3.3 (Proof by strong induction)\nIn order to prove a proposition of the form ∀n⩾n0,p(n), it suffices to prove that:\n• (Base case )p(n0)is true; and\n• (Induction step ) For all n⩾n0, ifp(k)is true for all n0⩽k⩽n, then p(n+1)is\ntrue.\nLike with weak induction, we can illustrate how strong induction works diagrammatic-\nally. The induction hypothesis, represented by the large square, now encompasses p(k)\nfor all n0⩽k⩽n, where p(n0)is the base case.\nn0 n0+1 ··· n−1 n n+1\nObserve that the only difference from weak induction is the induction hypothesis.\n•Weak induction step: Fixn⩾n0, assume p(n)is true , derive p(n+1);\n•Strong induction step: Fixn⩾n0, assume p(k)is true for all n0⩽k⩽n, derive\np(n+1).\nWe now use strong induction to complete the proof of Example 4.3.1.\n175\n176 Chapter 4. Mathematical induction\n✐Example 4.3.4 (Example 4.3.1 revisited)\nDefine a sequence recursively by\nb0=1 and bn+1=1+n",
  "Section 5.1: Relations": "Many interesting results or concepts in mathematics arise from observing how the ele-\nments of one set interact with the elements of another set, or how elements of a single\nset interact with each other. We can make this idea of ‘interaction’ precise using the\nnotion of a relation .\n✦Definition 5.1.1\nLetXandYbe sets. A ( binary )relation from XtoYis a logical formula R(x,y)with\ntwo free variables x∈Xandy∈Y. We call Xthedomain ofRandYthecodomain of\nR.\nA relation Rishomogeneous if it has the same domain and codomain X, in which case\nwe say that Ris a relation onX.\nGiven x∈Xandy∈Y, ifR(x,y)is true then we say ‘ xisrelated toybyR’, and write\nx R y (LATEX code:x \\mathrel{R} y ).\n✐Example 5.1.2\nWe have already seen many examples of relations.\n• Divisibility (‘ xdivides y’) is a relation on Z.\n• The inequality relation ⩽is a relation on R.\n• For any set X, equality =is a relation on X.\n• Logical equivalence ≡is a relation on the set of all logical formulae.\n• For any set X, the subset relation ⊆is a relation on P(X).\nThese relations were all homogeneous, but not all relations are:\n• For any set X, the elementhood relation ∈is a relation from XtoP(X).\n• Every function f:X→Yinduces a relation Rffrom XtoY, defined by taking x Rfy\nto mean f(x) =y.\n◁\n✎Exercise 5.1.3\nGive three more examples of relations, not all of which are homogeneous. ◁\n188\nSection 5.1. Relations 189\nLike with sets and functions, we must determine when to declare that two relations are\nequal. For example, consider the relation RonRdefined for a,b∈Rby letting a R b\nmean∃x∈R,a+x2=b. It so happens that a R b if and only if a⩽b—we’ll prove\nthis in Example 5.1.5. So should Rbe equal to ⩽? On the one hand you might say\n‘yes’, since ⩽andRrelate the same pairs of real numbers. On the other hand you\nmight say ‘no’, since the fact that ⩽andRrelate the same pairs of real numbers was\nnot immediate and required proof. In fact, if we were to replace RbyQ, it then ⩽and\nRwould notrelate the same pairs of elements, since for instance 0 ⩽2 but there is no\nrational number xsuch that 0 +x2=2.\nBut as with sets and functions, we settle for the extensional notion of equality: just as\ntwo sets are equal when they have the same elements (Axiom 2.1.22), and two functions\nare equal when they have the same values (Axiom 3.1.4), we consider two relations to\nbe equal when they relate the same pairs of elements (Axiom 5.1.4).\n✣Axiom 5.1.4 (Relation extensionality)\nLetRandSbe relations. Then R=Sif and only if RandShave the same domain X\nand codomain Y, and\n∀x∈X,∀y∈Y,(x R y⇔x S y)\nThat is, two relations with the same domain and codomain are equal precisely when\nthey relate the same pairs of elements.\n✐Example 5.1.5\nRecall the relation RonRthat we defined above for a,b∈Rby letting a R b if and only\nifa+x2=bfor some x∈R. To see that R=⩽, note that a+ (b−a) =b, and that\nb−ais the square of a real number if and only if b−a⩾0, which occurs if and only if\na⩽b. ◁\n✎Exercise 5.1.6\nLetRandSbe relations on Rdefined for a,b∈Rby lett",
  "Section 5.2: Equivalence relations and partitions": "An equivalence relation on a set Xis a relation on Xthat, to a certain extent, behaves\nlike equality . That is, equivalence relations give us a way of saying that two elements of\na set are ‘similar’, without having to be equal. As an example, we might be interested\nin when the base-10 expansions of two natural numbers end in the same digit, or when\ntwo finite sets have the same number of elements.\n✦Definition 5.2.1\nA relation Ron a set Xis an equivalence relation if it is reflexive, symmetric and\ntransitive.\nTo denote a relation that we know (or suspect) is an equivalence relation, we will usually\nuse a symbol like ‘ ∼’ (LATEX code:\\sim ) or ‘≡’ (LATEX code:\\equiv ) or ‘≈’ (LATEX\ncode:\\approx ) instead of a letter like ‘ R’ or ‘ S’.\n✐Example 5.2.2\nGiven any set X, it follows from Examples 5.1.20, 5.1.26 and 5.1.37 that the equality\nrelation =is an equivalence relation on X. This is a relief, since we motivated equival-\nence relations by saying that they are those that behave like equality! ◁\n✐Example 5.2.3\nLetRbe the relation on Rdefined for a,b∈Rbya R b if and only if b−a∈Q. Piecing\ntogether Examples 5.1.21, 5.1.27 and 5.1.38, we see that Ris an equivalence relation\nonR. ◁\n✎Exercise 5.2.4\nGiven a function f:X→Y, define a relation ∼fonXby\na∼fb⇔ f(a) =f(b)\nfor all a,b∈X. Prove that ∼fis an equivalence relation on X. ◁\nThe equivalence relation in the next exercise comes back with a vengeance in Sec-\ntion 10.1, where we will use it to compare the sizes of (finite and) infinite sets.\n✎Exercise 5.2.5\nLetSbe some set whose elements are all sets. (For example, we could take S=\nP(X)for some fixed set X.) Define a relation ∼=(LATEX code:\\cong ) onSby letting\nU∼=Vif and only if there exists a bijection f:U→V, for all U,V∈S. Prove that ∼=\nis an equivalence relation on S. ◁\n198\nSection 5.2. Equivalence relations and partitions 199\nA first look at modular arithmetic\nA particularly useful family of equivalence relations is given by congruence of integers,\nwhich allows us to do modular arithmetic —this is the topic of Section 7.3. For a fixed\ninteger n, this relation identifies two integers when they have the same remainder upon\ndivision by n(as in Theorem 0.19).\n✦Definition 5.2.6\nFixn∈Z. Given integers a,b∈Z, we say aiscongruent tobmodulo n, and write\na≡bmod n(LATEX code:a \\equiv b \\bmod{n} )\nifndivides a−b. Ifais not congruent to bmodulo n, write\na̸≡bmod n(LATEX code:\\not\\equiv )\nThe number nis called the modulus of the congruence.\nBefore we prove that congruence is modulo nis an equivalence relation for all n∈Z, it\nis worthwhile to get a feel for how it works.\n✐Example 5.2.7\nLeta,b∈Z. Then a≡bmod 2 if and only if aandbare both even or both odd—that\nis, if and only if they have the same parity .\nIndeed, by the division theorem, we can write a=2k+iandb=2ℓ+jfor some k,ℓ∈Z\nandi,j∈ {0,1}. Then\nb−a= (2k+i)−(2ℓ+j) = 2(k−ℓ)+(i−j)\nNote that i−j∈ {− 1,0,1}, and so a≡bmod 2 if and only if i=j. But this occurs if\nand only if i=j=0, in which case aandbare both even, or i",
  "Section 6.1: Finite sets": "As its title suggests, this section is all about exploring the properties of finite sets, and\nto do this we must first define what we mean by ‘finite’. We certainly know a finite set\nwhen we see one—for example:\n• The set {red,orange ,yellow ,green ,blue,purple}is finite.\n• The set [0,1]is infinite, but it has finite length.\n• The set [0,∞)is infinite and has infinite length.\n• The set P(N)is infinite, but has no notion of ‘length’ to speak of.\n• The empty set ∅is finite.\nIf we are to make a definition of ‘finite set’, we must first figure out what the finite sets\nabove have in common but the infinite sets do not.\nIt is difficult to define ‘finite’ without being imprecise. A first attempt at a definition\nmight be something like the following:\nA set X is finite if the elements of X don’t go on forever.\nThis is good intuition, but isn’t good enough as a mathematical definition, because ‘go\non’ and ‘forever’ are not precise terms (unless they themselves are defined). So let’s try\nto make this more precise:\nA set X is finite if the elements of X can be listed one by one\nin such a way that the list has both a start and an end.\nThis is better but is still not entirely precise—it is not entirely clear what is meant by\n‘listed one by one’. But we can make this precise. Let’s label the positions in our list\nwith natural numbers. To list the elements of Xmeans to specify an element of Xto\ngo in position 0, then another element of Xto go in position 1, and so on, until we\neventually run out of elements of X—the fact that we eventually run out of elements is\nexactly what we want to capture by our definition of ‘finite’.\nIf the listed elements of Xoccupy positions 0 ,1,..., n−1, this means that we have\neffectively paired up the elements of [n](the list positions) with the elements of X(the\nset being listed). Since ‘pairing up’ really means ‘finding a bijection’, we are now ready\nto define what it means for a set to be finite.\n214\nSection 6.1. Finite sets 215\n✦Definition 6.1.1\nA set Xisfinite if there exists a bijection f:[n]→Xfor some n∈N. The function fis\ncalled an enumeration ofX. IfXis not finite we say it is infinite .\nThis definition suggests the following strategy for proving that a set is finite.\n❖Strategy 6.1.2 (Proving that a set is finite)\nIn order to prove that a set Xis finite, it suffices to find a bijection [n]→Xfor some\nn∈N.\n✐Example 6.1.3\nLetX={red,orange ,yellow ,green ,blue,purple}, and define f:[6]→Xby\nf(0) =red f(1) =orange f(2) =yellow\nf(3) =green f(4) =blue f(5) =purple\nThe function fis evidently a bijection, since each element of Xcan be expressed\nuniquely as f(k)for some k∈[6]. SoXis finite. ◁\n✎Exercise 6.1.4\nProve that [n]is finite for each n∈N. ◁\nNote that Exercise 6.1.4 implies, in particular, that ∅is finite, since ∅= [0].\nThe size of a finite set\nWhilst it might sometimes be useful just to know thata set is finite, it will be even more\nuseful to know how many elements it has. This quantity is called the sizeof the set.\nIntuitively",
  "Section 6.2: Countable and uncountable sets": "In Section 6.1, we defined what it means for a set to be ‘finite’ in order to capture the\nidea that its elements can be listed in such a way that the list has a start and an end. We\ndid so by observing that a list of the elements of a finite set is essentially the same thing\nas a bijection f:[n]→Xfor some n∈N, with the element f(k)∈Xplaying the role of\nthe element in position kin the list.\nWe are now interested in infinite sets. We certainly can’t expect a list of all the elements\nof an infinite set to end, so the question now is: can its elements be listed if we allow\nthe list to be infinite? We will call such sets countable sets .\nIt is perhaps surprising that not every set is countable: some sets are ‘too big’ for their\nelements to be listed! We will prove that such uncountable sets exist later in this section.\nThe precise definition of what it means for a set Xto be countable (Definition 6.2.1)\ncaptures the idea that we can list the elements of Xone-by-one such that, even if the\nlist goes on forever, each element of Xappears at some finite stage in the list. The list\nmight or might not be finite; it has a start, but it might not have an end.\nTo illustrate, consider the following list of the elements of N:\n0,1,2,3,4, ..., n,n+1, ...\nThe list does not end, since Nis infinite (Theorem 6.1.25), but nevertheless every nat-\nural number appears at some finite stage along the list.\nAs another example, consider the set Zof all integers. We might wish to list the ele-\nments of Zin the usual way:\n...,−(n+1),−n, ...,−3,−2,−1,0,1,2,3, ..., n,n+1, ...\nThis does not fulfil our criterion that the list must have a start: it is infinite in both\ndirections. However, it is still possible to list them, by slotting the negative integers\nin-between the non-negative integers:\n0,−1,1,−2,2,−3,3, ...,−n,n,−(n+1),n+1, ...\nThis is not how we would usually think about listing the integers, but we have nonethe-\nless found a way of doing it so that every integer appears at some finite stage on the\nlist.\nBut specifying a list of the elements of an infinite set X, such that every element of X\nappears at some finite stage on the list, is equivalent to specifying a bijection f:N→X,\n224\nSection 6.2. Countable and uncountable sets 225\nwhere the element f(k)∈Xplays the role of the element in position kof the list—that\nis, the elements of Xcan be listed as\nf(0),f(1),f(2), ..., f(n),f(n+1), ...\nThis motivates the following definition.\n✦Definition 6.2.1\nA set Xiscountably infinite if there exists a bijection f:N→X. The bijection fis\ncalled an enumeration ofX. We say Xiscountable if it is finite or countably infinite.\nSome authors prefer to use ‘countable’ to mean ‘countably infinite’, in which case they\nwould say ‘finite or countable’ to mean ‘countable’.\n✐Example 6.2.2\nThe set Nis countably infinite, since by Exercise 3.2.19, the identity function id N:N→\nNis a bijection. This enumeration yields the usual list of natural numbers\n0,1,2,3, ..., n,n+1, ...\n◁\n✐Example 6.2.3\nThe function",
  "Section 7.1: Division": "This section introduces the notion of divisibility . As we have already mentioned, it\nis not always the case that one integer can divide another. As you read through this\nsection, note that we never use fractions; everything we do is internal toZ, and does\nnot require that we ‘spill over’ to Qat any point. This will help you when you study\nring theory in the future, and is a good practice to mimic in your own work.\nThe following theorem, called the division theorem, is the crux of everything that is to\nfollow.\n✣Theorem 7.1.1 (Division theorem)\nLeta,b∈Zwith b̸=0. There exists a unique pair (q,r)∈Z2such that\na=qb+rand 0 ⩽r<|b|\n❖Strategy\nLet’s first consider the case when a⩾0 and b>0 (so that |b|=b). Dropping the\nrequirement that 0 ⩽r<b, it is easy to find (q,r)∈Z2such that a=qb+r—indeed,\na=0·b+a, so we could take (q,r) = ( 0,a). However, this isn’t good enough, since if\na⩾bthen setting r=awould not satisfy the requirement that 0 ⩽r<b.\nHowever, if r⩾b, then (intuitively) we can make rsmaller by making qlarger—to see\nthis, note that\nqb+r= (q+1)b+(r−b)\nso whenever we have a pair (q,r)∈Z2such that a=qb+r, we can replace (q,r)by\n(q+1,r−b)to obtain another such pair with a smaller value of r.\nWe want to make ras small as possible without it becoming negative—in other words,\nwe want rto be the least natural number such that a=qb+rfor some q∈Z. This\nsuggests that we should prove the division theorem using the well-ordering principle\n(Theorem 4.3.11). ◁\nProof\nWe may assume that b>0: if not, replace bby−bandqby−qin the proof below.\n•Existence. Define X={r∈N|a=qb+rfor some q∈Z} ⊆N.\nNote first that Xis inhabited. Indeed:\n⋄Suppose a⩾0. Then a∈X, since a=0·b+a.\n⋄Suppose a<0. Since b>0 we have 1 −b⩽0, so that (1−b)a⩾0. But then\na=ab+(1−b)a, and so (1−b)a∈X.\n242\nSection 7.1. Division 243\nBy the well-ordering principle, Xhas a least element. Let rbe the least element of X,\nand let q∈Zbe such that a=qb+r—note that qexists by definition of X.\nWe have r⩾0 since r∈N, so it remains to prove that r<b. Well, if r⩾b, then\nr−b∈Nanda=qb+r= (q+1)b+ (r−b), which implies that r−b∈X; but\nr−b<rsince b>0, so this contradicts minimality of r. Therefore r<b, as required.\n•Uniqueness. Let(q0,r0),(q1,r1)∈Z2and assume that a=q0b+r0=q1b+r1and\nthat 0⩽r0,r1<b.\nWe may assume that r0⩽r1—otherwise, swap the roles of (q0,r0)and(q1,r1)in\nwhat follows.\nNote first that\n(q1−q0)b+(r1−r0) = ( q1b+r1)−(q0b+r0) =a−a=0\nSince r0⩽r1we have r1−r0⩾0, and since r1<bandr0⩾0 we have r1−r0<b.\nIfq1−q0<0, then q1−q0⩽−1 since q1−q0∈Z, and so\n0= (q1−q0)b+(r1−r0)⩽−b+(r1−r0)<b−b=0\nIfq1−q0>0, then q1−q0⩾1 since q1−q0∈Z, and so\n0= (q1−q0)b+(r1−r0)⩾b+(r1−r0)⩾b>0\nBoth of these are contradictions, so it must be the case that q1−q0=0, and so q0=q1.\nTherefore we have 0 = (q1−q0)b+(r1−r0) =r1−r0, and so r0=r1.\nSo(q0,r0) = ( q1,r1), as required.□\n✦Definition 7.1.2\nLeta,b∈Zwith b̸=0, and let q,rbe the unique integers such that\na=qb+rand 0 ⩽r<|b|\nWe say qis the quotient andris the remainder ofadivided by b.\n✐Example 7.1.3\nSom",
  "Section 7.2: Prime numbers": "Thinking of divisibility as a way of breaking down an integer, for example 12 =2×2×\n3, our goal now is to show that there are particular integers that are atomic —they are\nthe building blocks of the integers, in the sense that:\n• Every integer can be broken into a product of these atomic integers. . .\n• . . . and these atomic integers cannot themselves be broken down any further. . .\n• . . . andthere is an essentially unique way to write an integer as a product of these\natomic integers.\nThere are a couple of fairly vague terms used here: ‘atomic’ and ‘essentially unique’.\nBut as always, we will make these terms precise when we need to.\nPrimes and irreducibles\nThere are two ways that we might want to characterise the so-called atomic integer that\nwe just mentioned.\n• One way that an integer might be atomic is if it allows us to break down products of\nintegers—this leads to the notion of prime (Definition 7.2.1).\n• Another way is that an integer might be atomic is if it cannot be split up as a product\nof more than one integer (in a nontrivial way)—this leads to the notion of irreducible\n(Definition 7.2.6).\nConveniently, as we will show in Theorem 7.2.11, these two notions coincide. But the\nfact that they coincide is not obvious, and uses essential properties of the integers that\ndo not hold in more general structures.\nThe definition of prime that we are about to give comes from abstract algebra (specific-\nally, from ring theory). It might seem strange, but we will soon be able to show that the\nmore familiar definition—that is, having exactly two positive divisors—is equivalent to\nthis one.\n✦Definition 7.2.1\nAn integer pis (ring theoretically )prime ifpis a nonzero nonunit and, for all a,b∈Z,\nifp|abthen p|aorp|b.\n258\nSection 7.2. Prime numbers 259\n✐Example 7.2.2\n2 is prime. To see this, suppose it isn’t. Then there exist a,b∈Zsuch that 2 |abbut 2\ndivides neither anorb. Thus aandbare both odd, meaning that abis odd. . . but this\ncontradicts the assumption that 2 |ab.\nHowever, 18 is not prime. Indeed, 18 |12×15 but 18 divides neither 12 nor 15. ◁\n✎Exercise 7.2.3\nUsing Definition 7.2.1, prove that 3 and 5 are prime, and that 4 is not prime. ◁\n✐Example 7.2.4\nLetk∈Zwith 0 <k<5. We’ll show that 5 |\u00005\nk\u0001\n.\nWell, by Theorem 4.2.14 we know that\n5!=\u00125\nk\u0013\nk!(5−k)!\nBy Definition 4.1.14, we have\n5×4!|{z}\n=5!=\u00125\nk\u0013\n×1×···× k|{z}\n=k!×1×···× (5−k)|{z }\n=(5−k)!\nSince 5 is prime, it must divide one of the factors on the right-hand side of this equation.\nThus, either 5 divides\u00005\nk\u0001\n, or it divides ℓfor some 1 ⩽ℓ⩽kor 1⩽ℓ⩽5−k. But k<5\nand 5−k<5, so it cannot divide any of these values of ℓ—if it did, it would imply\n5⩽ℓ⩽kor 5⩽ℓ⩽5−k, which is nonsense. Hence 5 must divide\u00005\nk\u0001\n. ◁\n✎Exercise 7.2.5\nLetp∈Zbe a positive prime and let 0 <k<p. Show that p|\u0000p\nk\u0001\n. ◁\nWe now arrive at our second notion of atomic , capturing the idea that it should not be\npossible to break an atomic integer into smaller parts.\n✦Definition 7.2.6\nAn integer aisirreducible ifais a nonzero nonunit and,",
  "Section 7.3: Modular arithmetic": "Recall the definition of congruence modulo an integer from Section 5.2.\n✦Definition 5.2.6\nFixn∈Z. Given integers a,b∈Z, we say aiscongruent tobmodulo n, and write\na≡bmod n(LATEX code:a \\equiv b \\bmod{n} )\nifndivides a−b. Ifais not congruent to bmodulo n, write\na̸≡bmod n(LATEX code:\\not\\equiv )\nThe number nis called the modulus of the congruence.\nIn Section 5.2, we proved that congruence is an equivalence relation:\n✣Theorem 5.2.11\nLetn∈Z. Then congruence modulo nis an equivalence relation on Z. That is:\n(a)a≡amod nfor all a∈Z;\n(b) For all a,b∈Z, ifa≡bmod n, then b≡amod n;\n(c) For all a,b,c∈Z, ifa≡bmod nandb≡cmod n, then a≡cmod n.\nIn this section, we turn our attention to addition, subtraction, multiplication and divi-\nsion: our goal is to find out how much arithmetic can be done with equality replaced by\ncongruence . For example:\n(i) Can we add a number to both sides of a congruence? That is, given a,b,c,n∈Z,\nis it the case that a≡bmod nimplies a+c≡b+cmod n?\n(ii) Can we multiply both sides of a congruence by a number? That is, given\na,b,c,n∈Z, is it the case that a≡bmod nimplies ac≡bcmod n?\n(iii) Can we divide both sides of a congruence by a nonzero common factor? That is,\ngiven a,b,c,n∈Zwith c̸≡0 mod n, is it the case that if ac≡bcmod nimplies\na≡bmod n?\n267\n268 Chapter 7. Number theory\nThe answers to (i) and (ii) are ‘yes’, as we will prove; but surprisingly, the answer to\n(iii) is ‘no’ (except under certain circumstances). For example, 2 ×3≡4×3 mod 6,\nbut 2̸≡4 mod 6, even though 3 ̸≡0 mod 6.\nIn light of this, it is important from the outset to point out that, although congruence is\nwritten with a symbol that looks like that of equality (‘ ≡’ vs. ‘ =’), and although it is an\nequivalence relation, we can only treat congruence like equality inasmuch as we prove\nthat we can. Specifically:\n• In Theorem 5.2.11 we proved that congruence is an equivalence relation. This al-\nlows us to make some basic inferences about congruences—for example, transitivity\nmeans that the following implication is valid:\n−5≡18≡41≡64 mod 23 ⇒ − 5≡64 mod 23\n• Theorem 7.3.3, which we will prove soon, tells us that we can treat congruence like\nequality for the purposes of addition, multiplication and subtraction. Thus it will be\nvalid to write things like\nx≡7 mod 12 ⇒ 2x+5≡19 mod 12\nand we’ll be able to replace values by congruent values in congruences, provided\nthey’re only being added, subtracted or multiplied. For example, from the knowledge\nthat 260≡1 mod 61 and 60! ≡ −1 mod 61, we will be able to deduce\n260·3≡60!·xmod 61 ⇒ 3≡ −xmod 61\nAfter we have worked out what arithmetic properties carry over to congruence, we will\nbe able to prove some interesting theorems involving congruences and discuss their\napplications.\nThe first result we prove gives us a few equivalent ways of talking about congruence.\n✣Proposition 7.3.1\nFix a modulus nand let a,b∈Z. The following are equivalent:\n(i)aandbleave the same remainder when divided by n;\n(ii)a=b+knfor some k∈Z;\n(iii) a≡bmod n.\nProof\n",
  "Section 8.1: Counting principles": "In Section 6.1 we were interested in establishing conditions under which a set is finite,\nand proving that we may perform certain operations on finite sets—such as unions and\ncartesian products—without losing the property of finiteness.\nIn this section, our attention turns to the task of finding the size of a set that is known\nto be finite. This process is called counting and is at the core of the mathematical field\nof combinatorics.\nBinomials and factorials revisited\nWe defined binomial coefficients\u0000n\nk\u0001\nand factorials n!recursively in Chapter 4, and\nproved elementary facts about them by induction. We will now re-define them com-\nbinatorially —that is, we give them meaning in terms of sizes of particular finite sets.\nWe will prove that the combinatorial and recursive definitions are equivalent, and prove\nfacts about them using combinatorial arguments.\nThe reasons for doing so are manifold. The combinatorial definitions allow us to reason\nabout binomials and factorials with direct reference to descriptions of finite sets, which\nwill be particularly useful when we prove identities about them using double counting .\nMoreover, the combinatorial definitions remove the seemingly arbitrary nature of the\nrecursive definitions—for example, they provide a reason why it makes sense to define\n0!=1 and\u00000\n0\u0001\n=1.\n✦Definition 8.1.1\nLetXbe a set and let k∈N. A k-element subset ofXis a subset U⊆Xsuch that\n|U|=k. The set of all k-element subsets of Xis denoted\u0000X\nk\u0001\n(read: ‘ Xchoose k’)\n(LATEX code:\\binom{X}{k} ).\nIntuitively,\u0000X\nk\u0001\nis the set of ways of picking kelements from X, without repetitions,\nin such a way that order doesn’t matter. (If order mattered, the elements would be\nsequences instead of subsets .)\n✐Example 8.1.2\nWe find\u0000[4]\nk\u0001\nfor all k∈N.\n•\u0000[4]\n0\u0001\n={∅}since the only set with 0 elements is ∅;\n298\nSection 8.1. Counting principles 299\n•\u0000[4]\n1\u0001\n={{0},{1},{2},{3}};\n•\u0000[4]\n2\u0001\n={{0,1},{0,2},{0,3},{1,2},{1,3},{2,3}};\n•\u0000[4]\n3\u0001\n={{0,1,2},{0,1,3},{0,2,3},{1,2,3}};\n•\u0000[4]\n4\u0001\n={{0,1,2,3}};\n• Ifk⩾5 then\u0000[4]\nk\u0001\n=∅, since by Exercise 6.1.17, no subset of [4]can have more than\n4 elements.\n◁\n✣Proposition 8.1.3\nIfXis a finite set, then P(X) =[\nk⩽|X|\u0012X\nk\u0013\n.\nProof\nLetU⊆X. By Exercise 6.1.17, Uis finite and |U|⩽|X|. Thus U∈\u0000X\n|U|\u0001\n, and hence\nU∈[\nk⩽|X|\u0012X\nk\u0013\n. This proves that P(X)⊆[\nk⩽|X|\u0012X\nk\u0013\n.\nThe fact that[\nk⩽|X|\u0012X\nk\u0013\n⊆P(X)is immediate, since elements of\u0000X\nk\u0001\nare defined to be\nsubsets of X, and hence elements of P(X). □\n✦Definition 8.1.4\nLetn,k∈N. Denote by\u0000n\nk\u0001\n(read: ‘ nchoose k’) (L ATEX code:\\binom{n}{k} ) the\nnumber of k-element subsets of [n]. That is, we define\u0000n\nk\u0001\n=\f\f\f\u0000[n]\nk\u0001\f\f\f. The numbers\u0000n\nk\u0001\nare called binomial coefficients .\nSome authors use the notation nCkornCkinstead of\u0000n\nk\u0001\n. We avoid this, as it is unne-\ncessarily clunky.\nIntuitively,\u0000n\nk\u0001\nis the number of ways of selecting kthings from n, without repetitions,\nin such a way that order doesn’t matter.\nThe value behind this notation is that it allows us to express huge numbers in a concise\nand meaningf",
  "Section 8.2: Alternating sums": "Using the addition principle, together with double counting, turned out to be very useful\nfor proving combinatorial identities involving sums in Section 8.1. In this section, we\nturn our attention to alternating sums , which are sums whose terms alternate between\npositive and negative. As we will see later, sums of this kind can be used to comput-\ning sizes of unions of not-necessarily-disjoint sets—this has all manner of uses and\napplications.\nAn example of such a sum is the following.\n\u00126\n0\u0013\n−\u00126\n1\u0013\n+\u00126\n2\u0013\n−\u00126\n3\u0013\n+\u00126\n4\u0013\n−\u00126\n5\u0013\n+\u00126\n6\u0013\nWe can express such sums more succinctly by observing that, given k∈N, we have\n(−1)k=(\n1 if kis even\n−1 if kis odd\nFor example, the sum above could be expressed as6\n∑\nk=0(−1)k\u00126\nk\u0013\n. It so happens that\nthis sum evaluates to zero:\n1−6+15−20+15−6+1=0\nThe goal of the following exercise is to demonstrate how. . . annoying . . . it is to prove\nidentities involving alternating sums using induction.\n✎Exercise 8.2.1\nProve by induction thatn\n∑\nk=0(−1)k\u0012n\nk\u0013\n=0 for all n∈N. ◁\nEvidently we need a better approach.\nIf you stare at the equation in Exercise 8.2.1 for long enough, you should be able to\nconvince yourself that\nn\n∑\nk=0(−1)k\u0012n\nk\u0013\n=∑\neven k\u0012n\nk\u0013\n−∑\noddk\u0012n\nk\u0013\nand it suffices to prove that ∑\neven k\u0012n\nk\u0013\n=∑\noddk\u0012n\nk\u0013\n. This will be our strategy in the proof\nof Proposition 8.2.2, which serves as our prototype for the abstract material to come.\n318\nSection 8.2. Alternating sums 319\nFor the sake of readability, we left implicit that kis varying over (the even or odd\nelements of) the set {0,1,..., n}in each sum—we shall adopt this practice throughout\nthis section.\n✣Proposition 8.2.2\nLetn∈Nwith n>0. Thenn\n∑\nk=0(−1)k\u0012n\nk\u0013\n=0.\nProof\nAs we observed, it suffices to prove\n∑\neven k\u0012n\nk\u0013\n=∑\noddk\u0012n\nk\u0013\nSo define\nE={U⊆[n]| |U|is even }andO={U⊆[n]| |U|is odd}\nThat is, Eis the set of all even-sized subsets of [n], andOis the set of all odd-sized\nsubsets of [n].\nNote that the sets\u0012[n]\nk\u0013\nfor even k⩽npartition E, and the sets\u0012[n]\nk\u0013\nfor odd k⩽n\npartition O. So by the addition principle, we have\n|E|=\f\f\f\f\f[\neven k\u0012[n]\nk\u0013\f\f\f\f\f=∑\neven k\u0012n\nk\u0013\nand|O|=\f\f\f\f\f[\noddk\u0012[n]\nk\u0013\f\f\f\f\f=∑\noddk\u0012n\nk\u0013\nIt suffices to show that |E|=|O|. To do this, define a function f:E→OforU∈Eby\nf(U) =(\nU∪{0}if 0̸∈U\nU\\{0}if 0∈U\nThat is, fputs 0 into a subset if it wasn’t already there, and removes it if it was. Then:\n•fis well-defined. Given U∈E, note that |f(U)|=|U|±1; since |U|is even, we\nhave that |f(U)|is odd, so that f(U)∈O.\n•fis bijective. Define g:O→Eby letting\ng(V) =(\nV∪{0}if 0̸∈V\nV\\{0}if 0∈V\nfor all V∈O. The proof that gis well-defined is identical to that of f. Moreover,\ngiven U∈E, we have:\n319\n320 Chapter 8. Enumerative combinatorics\n⋄If 0∈U, then f(U) =U\\{0}, so that g(f(U)) = ( U\\{0})∪{0}=U.\n⋄If 0̸∈U, then f(U) =U∪{0}, so that g(f(U)) = ( U∪{0})\\{0}=U.\nHence g(f(U)) =Ufor all U∈E. An identical computation reveals that f(g(V)) =V\nfor all V∈O, and so gis an inverse for f.\nPutting all of this together, it follows form the fact that f:E→Ois a bijection that\n|E|=|O|, and so",
  "Section 9.1: Inequalities and means": "We first encountered the real numbers in Chapter 0, when the real numbers were intro-\nduced using a vague (but intuitive) notion of an infinite number line (Definition 0.26):\n−5−4−3−2−1 0 1 2 3 4 5\nThis section will scrutinise the set of real numbers in its capacity as a complete ordered\nfield. Decomposing what this means:\n• A field is a set with a notion of ‘zero’ and ‘one’, in which it makes sense to talk\nabout addition, subtraction, multiplication, and division by everything except zero.\nExamples are Q,R, andZ/pZwhen pis a prime number (but not when pis compos-\nite). However, Zis not a field, since we can’t freely divide by nonzero elements—for\nexample, 1 ∈Zand 2∈Z, but no integer nsatisfies 2 n=1.\n• An ordered field is a field which is equipped with a well-behaved notion of order.\nBothQandRare ordered fields, but Z/pZis not. We’ll see why soon.\n• Acomplete ordered field is an ordered field in which every set with an upper bound\nhas a least upper bound. As we will see, Qis not a complete ordered field, but Ris.\nThis is made (extremely) precise in Section B.2.\nMagnitude and scalar product\nIn this part of the section, we home in on sets of the form Rn, forn∈N. Elements of Rn\nare sequences of the form (x1,x2,..., xn), where each xi∈R. With our interpretation\nof the reals Ras a line, we can interpret a sequence (x1,x2,..., xn)as a point in n-\ndimensional space :\n• 0-dimensional space is a single point. The set R0has one element, namely the empty\nsequence (), so this makes sense.\n• 1-dimensional space is a line. This matches our intuition that R=R1forms a line.\n• 2-dimensional space is a plane . The elements of R2are pairs (x,y), where xandyare\nboth real numbers. We can interpret the pair (x,y)ascoordinates for a point which is\nsituated xunits to the right of (0,0)andyunits above (0,0)(where negative values\nofxoryreverse this direction)—see Figure 9.1.\n338\nSection 9.1. Inequalities and means 339\nxy\n(0,0)(√\n2,√\n2)\n(0,−2)(2,0)(−2,3\n2)\nFigure 9.1: Some points in R2\nWith this intuition in mind, we set up the following notation.\n✦Notation 9.1.1\nLetn∈N. Elements of Rnwill be denoted ⃗x,⃗y,⃗z,... (LATEX code:\\vec ) and called\n(n-dimensional )vectors . Given a vector ⃗x∈Rn, we write xifor the ithcomponent of\n⃗x, so that\n⃗x= (x1,x2,..., xn)\nThe element (0,0,..., 0)∈Rnis called the origin orzero vector ofRn, and is denoted\nby⃗0.\nMoreover, if ⃗x,⃗y∈Rnanda∈Rwe write\n⃗x+⃗y= (x1+y1,x2+y2,..., xn+yn)and a⃗x= (ax1,ax2,..., axn)\n✐Example 9.1.2\nFor all ⃗x∈Rn, we have\n⃗x+⃗0=⃗xand 1 ⃗x=⃗x\n◁\n339\n340 Chapter 9. Real numbers\n✦Definition 9.1.3\nLet⃗x∈Rn. The magnitude of⃗xis the real number ∥⃗x∥(LATEX code:\\lVert \\vec x\n\\rVert ) defined by\n∥⃗x∥=s\nn\n∑\ni=1x2\ni=q\nx2\n1+x2\n2+···+x2n\nGiven vectors ⃗x,⃗y∈Rn, the distance from⃗xto⃗yis defined to be ∥⃗y−⃗x∥. Thus the\nmagnitude of a vector can be thought of as the distance from that vector to the origin.\n✐Example 9.1.4\nInR2, Definition 9.1.3 says that\n∥(x,y)∥=p\nx2+y2\nThis matches the intuition obtained from the Pythagorean theorem o",
  "Section 9.2: Completeness and convergence": "For most of the results that we proved in Section 9.1, it did not matter that we were\ntalking about real numbers. We could just as well have been working with any other\nordered field, such as the rational numbers—that is, most of the results in",
  "Section 9.1: remain true by replacing RbyQ(or any other ordered field) throughout.": "From here onwards, we isolate the property of Rthat separates it from Q—namely,\ncompleteness . It is completeness that will allow us to define and explore the funda-\nmental concepts of mathematical analysis: sequences, functions, convergence, limits,\ncontinuity, differentiability, and so on.\nThe property of completeness concerns least upper bounds for certain sets of real num-\nbers.\n✦Definition 9.2.1\nLetA⊆R. A real number mis an upper bound forAifa⩽mfor all a∈A. A\nsupremum ofAis aleast upper bound of A; that is, a real number msuch that:\n(i)mis an upper bound of A—that is, a⩽mfor all a∈A; and\n(ii)mis least amongst all upper bounds for A—that is, for all x∈R, ifa⩽xfor all\na∈A, then m⩽x.\n✐Example 9.2.2\nWe prove that 1 is a supremum of the open interval (0,1).\n(i) Let a∈(0,1). Then a<1, so that 1 is an upper bound of (0,1).\n(ii) Let x∈Rbe another upper bound of (0,1). Ifx<1, then we have\nx=x+x\n2<x+1\n2<1+1\n2=1\nand so x<x+1\n2∈(0,1). This contradicts the assumption that xis an upper\nbound of (0,1). It follows that x⩾1, as required.\nHence 1 is indeed a supremum of (0,1). ◁\n✎Exercise 9.2.3\nDefine the notions of lower bound andinfimum , and find the infimum of the open\ninterval (0,1). ◁\n357\n358 Chapter 9. Real numbers\nThe following proposition provides a convenient way of testing whether a real number\nis a supremum of a subset.\n✣Proposition 9.2.4\nLetA⊆Rand suppose m∈Ris an upper bound of A. Then mis a supremum of Aif\nand only if, for all ε>0, there exists a∈Asuch that a>m−ε.\nProof\n• (⇒). Suppose mis a supremum of A, and let ε>0. If there is no a∈Asuch that\na>m−ε, then a⩽m−εfor all a∈A. But this contradicts the assumption that m\nis a supremum of a, since m−εis an upper bound of Athat is less than m. So there\nexists a∈Awith a>m−ε, as required.\n• (⇐). Suppose that, for all ε>0, there exists a∈Awith a>m−ε, and let x∈Rbe\nan upper bound of A. In order to prove that mis a supremum of A, we must prove that\nm⩽x.\nSuppose x<m, and define ε=m−x. Then ε>0, so there exists a∈Asuch that\na>m−ε=m−(m−x) =x\nBut this contradicts the assumption that xis an upper bound of A. So we must have\nm⩽x, as required.\n□\n✣Theorem 9.2.5 (Uniqueness of suprema)\nLetAbe a subset of R. Ifm1andm2are suprema of A, then m1=m2.\nProof\nSince m1is an upper bound of Aandm2is a supremum of A, we have m2⩽m1by\nDefinition 9.2.1(ii). Likewise, since m2is an upper bound of Aandm1is a supremum\nofA, we have m1⩽m2by Definition 9.2.1(ii) again. But this implies that m1=m2.□\nAn analogous result proves that a subset of Rmay have at most one infimum. This\nallows us to introduce the following notation.\n✦Definition 9.2.6\nLetA⊆R. The supremum of A, if it exists is denoted by sup (A)(LATEX code:\n\\mathrm{sup} ); the infimum of A, if it exists, is denoted by inf (A)(LATEX code:\n\\mathrm{inf} ).\nNow that we are more familiar with suprema, here is the completeness axiom in its full\nglory.\n358\nSection 9.2. Completeness and convergence 359\n✣Axiom 9.2.7 (Completeness axiom)\nLetA⊆Rbe inhabited. If Ahas an upper bound, then Ah",
  "Section 9.3: Series and sums": "Aseries can be thought of as the result of adding up all of the terms in a sequence. The\nuses of series inside and outside of mathematics is widespread, particularly in analysis\nand statistics. In fact, we will use series repeatedly when we study probability theory\nin Chapter 11!\nUnfortunately the definition of a series is not quite as simple as ‘the result of adding up\nall of the terms in a sequence’. For a start, we haven’t defined what means to add up\ninfinitely many numbers, and sometimes this might not even be possible—for example,\nyou might encounter problems if you try adding up all of the terms in the constant\nsequence (1,1,1,...).\nThe definition of a series, then, is that of a formal sum (see Definition 9.3.1). The word\n‘formal’ here means that it is an expression that represents a sum, but is not actually\nevaluated. So for example\n1+1+1+···\nis a series.\nWe will then separately define what it means for it to be possible to evaluate an infinite\nsum represented by a series (Definition 9.3.3); this definition implies that the series\n1+1+1+···is not summable, for example.\n✦Definition 9.3.1\nA (real)series is a formal sum of a sequence (an)n⩾0, denoted by\n∑\nn⩾0an(LATEX code:\\sum_{n \\ge 0} )\nor by∞\n∑\nn=0an(LATEX code:\\sum_{n=0}ˆ{\\infty} ), or even by a0+a1+a2+···.\nAs with sequences, it is possible for a series to be indexed from a different starting\nnumber, like in the next example.\n✐Example 9.3.2\nThe sequence (1\nk)k⩾1defines the series\n∑\nk⩾11\nk=1\n1+1\n2+1\n3+1\n4+···\n382\nSection 9.3. Series and sums 383\nWe will soon see that this series diverges (Theorem 9.3.27), since adding these terms\ntogether one by one yields unboundedly larger and larger real numbers. ◁\nSeries in isolation are not particularly useful or interesting. They become so by defining\nwhat it means to evaluate them—at least, when it is possible to do so.\n✦Definition 9.3.3\nLetN∈N. The Nthpartial sum of a series ∑\nn⩾0anis the real number sN=N\n∑\nn=0an.\nWe say that the series converges if the sequence of partial sums (sN)N⩾0converges; in\nthis case, the sum of the series is the real number lim\nN→∞(sN), also written ∑\nn⩾0an.\nIf the sequence of partial sums (sN)N⩾0diverges, then we say the series diverges .\n✐Example 9.3.4\nConsider the series\nS=∑\nn⩾2\u0012n\n2\u0013−1\nWe prove that Sconverges and its sum is 2.\nTo see this, note that for all n⩾2, we have by Theorem 4.2.14 that\n\u0012n\n2\u0013−1\n=\u0012n(n−1)\n2\u0013−1\n=2\nn(n−1)=2\nn−1−2\nn\nTherefore, for all N⩾2, the Nthpartial sum of Sis given by\nsN=N\n∑\nn=2\u0012n\n2\u0013−1\n=\u00122\n1−2\n2\u0013\n+\u00122\n2−2\n3\u0013\n+···+\u00122\nN−1−2\nN\u0013\n=2−2\nN\nIt follows that S=lim\nN→∞(sN) =2, as required. ◁\n✎Exercise 9.3.5\nProve that the series ∑\nn⩾3\u0012n\n3\u0013−1\nconverges, and find its sum. ◁\n✐Example 9.3.6\nWe prove that the series ∑\nn⩾01 diverges. Indeed, for all N∈N, we have\nN\n∑\nn=0=1+1+···+1|{z}\nN+1 times=N+1\n383\n384 Chapter 9. Real numbers\nThus the sequence of partial sums is unbounded, so does not converge to a real number.\n◁\n✎Exercise 9.3.7\nProve that the series ∑\nn⩾0(−1)ndiverges. ◁\nThe underlying reason why the series i",
  "Section 10.1: Cardinality": "Section 6.1 was all about defining a notion of sizefor finite sets, and using this definition\nto compare and contrast the sizes of finite sets by constructing injections, surjections\nand bijections between them.\nWe made some progress in comparing the sizes of infinite sets in Section 6.2, but only\nto a certain extent: at this point, we can only distinguish between two sizes of infin-\nity, namely ‘countable’ and ‘uncountable’. While this is interesting, we can do much\nbetter—that is where this section comes in.\nThecardinality (defined in Definition 10.1.1) of a set can be understood as a measure\nof its size, generalising the notion of size for finite sets. In particular:\n• Whereas the size of a finite setXis a natural number |X| ∈N, the cardinality of\nan arbitrary set is a cardinal number —but if the set happens to be finite, then this\ncardinal number is equal to the natural number given by its size.\n• We proved in Theorem 6.1.14 that two finite sets XandYhave equal size if and only\nif there is a bijection X→Y. We generalise this fact to arbitrary sets by building it\ninto the definition of cardinality: that is, two sets XandYwill have equal cardinality\nif and only if there is a bijection X→Y.\nWithout further ado, behold the definition of cardinality.\n✦Definition 10.1.1\nThe cardinality of a set Xis an element |X|of the collection Card (LATEX code:\n\\mathsf{Card} ) of all cardinal numbers , defined so that the following properties\nhold:\n(i) For every set X, there is a unique cardinal number κ∈Card such that |X|=κ;\n(ii) For all sets XandY, we have |X|=|Y|if and only if there exists a bijection\nX→Y;\n(iii)N⊆Card , and if Xis finite, then its cardinality |X|is equal to its size; and\n(iv) For each cardinal number κ, there exists a set [κ]with|[κ]|=κ, with [n]defined\nas in Definition 2.1.9 for all n∈N⊆Card .\nA cardinal number κ∈Card\\Nis called an infinite cardinal number .\n410\nSection 10.1. Cardinality 411\nCondition (iii) ensures that cardinality generalises the notion of size: whereas size is\ndefined only for finite sets, cardinality is defined for both finite and infinite sets.\nDefinition 10.1.1 tells us only what properties cardinal numbers satisfy; it doesn’t tell\nus what they actually are, how they are defined, or even whether they exist. This is on\npurpose: the construction of the cardinal numbers is very intricate, and far beyond the\nscope of this introductory textbook.\nOne cardinal number of interest to us is the cardinality of the natural numbers. In a\nsense that we will make precise later (Theorem 10.1.13), we can think of this cardinal\nnumber as being the smallest infinite cardinal number.\n✦Definition 10.1.2\nThe cardinal number ℵ0(LATEX code:\\aleph_0 ), called aleph naught (oraleph null ),\nis defined by ℵ0=|N|.\nThe symbol ℵis the Hebrew letter aleph . The cardinal number ℵ0is the first infinite\ncardinal number in a hierarchy of so-called well-orderable cardinals .\n✐Example 10.1.3\nA set Xis countably infinite if and only if |X|=ℵ0. Indeed, to say",
  "Section 10.2: Cardinal arithmetic": "In this section we will define arithmetic operations for cardinal numbers, and then derive\ninfintary counting principles by analogy with Section 8.1. It is surprising how little\nadditional work needs to be done for the results proved there to carry over.\nWe begin by defining the sum κ+λ, product κ·λand power λκ, for cardinal numbers\nκandλ.\nCardinal addition\n✦Definition 10.2.1\nThe ( cardinal )sum of cardinal numbers κandλis the cardinal number κ+λdefined\nby\nκ+λ=|[κ]⊔[λ]|\nwhere for sets AandB, the notation A⊔Bdenotes the disjoint union\nA⊔B= (A×{0})∪(B×{1})\nas discussed in Exercise 6.1.20.\nNote that Definition 10.2.1 is compatible with addition for natural numbers by Exer-\ncise 6.1.20(b), which implies that |[m]⊔[n]|=m+nfor all m,n∈N.\nThe following lemma makes cardinal addition easier to work with.\n✣Lemma 10.2.2\nLetXandYbe sets. If X∩Y=∅, then|X∪Y|=|X|+|Y|.\nProof\nLetκ=|X|andλ=|Y|. Note that |[κ]×{0}|=κ=|X|and|[λ]×{1}|=λ=|Y|, so\nthere are bijections f:[κ]×{0} → Xandg:[λ]×{1} → Y.\nDefine a function h:[κ]⊔[λ]→X∪Yby\nh(a,i) =(\nf(a)ifi=0\ng(b)ifi=1\nfor all (a,i)∈[κ]⊔[λ].\n419\n420 Chapter 10. Infinity\nThen his a bijection; to see this, define k:X∪Y→[κ]⊔[λ]by\nk(a) =(\n(f−1(a),0)ifa∈X\n(g−1(a),1)ifa∈Y\nfor all a∈X∪Y. Then kis well-defined since X∩Y=∅and fandgare bijections.\nAnd kcan readily be seen to be an inverse for h.\nSince h:[κ]⊔[λ]→X∪Yis a bijection, we have\n|X∪Y|=|[κ]⊔[λ]|=κ+λ\nas required. □\n✐Example 10.2.3\nWe show that ℵ0+ℵ0=ℵ0. To see this, note that N=E∪O, where Eis the set of\nall even natural numbers and Ois the set of all odd natural numbers. But EandOare\ndisjoint, so that by Lemma 10.2.2 we have\nℵ0+ℵ0=|E|+|O|=|E∪O|=|N|=ℵ0\nas claimed. ◁\nMany of the basic properties enjoyed by addition of natural numbers carry over to\ncardinal numbers.\n✣Theorem 10.2.4 (Properties of cardinal addition)\n(a)κ+(λ+µ) = (κ+λ)+µfor all cardinal numbers κ,λ,µ;\n(b)κ+λ=λ+κfor all cardinal numbers κ,λ;\n(c) 0 +κ=κ=κ+0 for all cardinal numbers κ.\nProof of (a)\nLetκ,λandµbe cardinal numbers, and define\nX= [κ]×{0},Y= [λ]×{1},Z= [µ]×{2}\nNote that |X|=κ,|Y|=λand|Z|=µ, and that X,YandZare pairwise disjoint.\nTherefore XandY∪Zare disjoint, and X∪YandZare disjoint, so that\nκ+(λ+µ) =|X|+(|Y|+|Z|) =|X|+|Y∪Z|=|X∪(Y∪Z)|\nand likewise\n(κ+λ)+µ= (|X|+|Y|)+|Z|=|X∪Y|+|Z|=|(X∪Y)∪Z|\nButX∪(Y∪Z) = ( X∪Y)∪Z, so that κ+(λ+µ) = (κ+λ)+µ, as required. □\n420\nSection 10.2. Cardinal arithmetic 421\n✎Exercise 10.2.5\nProve parts (b) and (c) of Theorem 10.2.4. ◁\nWe can generalise the argument in Example 10.2.3 to prove the following proposition.\n✣Proposition 10.2.6\nκ+ℵ0=κfor all cardinal numbers κ⩾ℵ0.\nProof\nLetκ⩾ℵ0and let A= [κ]. Note that by Definition 10.1.7 there is an injection i:N→A.\nWrite an=i(n)for all n∈N, so that i[N] ={a0,a1,a2,...} ⊆A.\nPartition AasA=B∪U∪V, where:\n•B=A\\i[N] =A\\{a0,a1,a2,a3,...};\n•U=i[E] ={a0,a2,a4,...}; and\n•V=i[O] ={a1,a3,a5,...}.\nHere EandOare the sets of even and odd natural numbers, respectfully.\nThe sets U,Vandi[N]are all countably infinite, since E,OandNare countably infinite\nandiis",
  "Section 11.1: Discrete probability spaces": "Probability theory is a field of mathematics which attempts to model randomness and\nuncertainty in the ‘real world’. The mathematical machinery it develops allows us to\nunderstand how this randomness behaves and to extract information which is useful for\nmaking predictions.\nDiscrete probability theory, in particular, concerns situations in which the possible out-\ncomes form a countable set. This simplifies matters considerably: if there are only\ncountably many outcomes, then the probability that any event occurs is determined\nentirely by the probabilities that the individual outcomes comprised by the event occur.\nFor example, the number Nof words spoken by a child over the course of a year takes\nvalues in N, so is discrete. To each n∈N, we may assign a probability that N=n,\nwhich can take positive values in a meaningful way, and from these probabilities we\ncan compute the probabilities of more general events occurring (e.g. the probability\nthat the child says under a million words). However, the height Hgrown by the child\nover the same period takes values in [0,∞), which is uncountable; for each h∈[0,∞),\nthe probability that H=his zero, so these probabilities give us no information. We\nmust study the behaviour of Hthrough some other means.\nIn this chapter, we will concern ourselves only with the discrete setting.\nIt is important to understand from the outset that, although we use language like\noutcome ,event ,probability andrandom , and although we use real-world examples,\neverything we do concerns mathematical objects: sets, elements of sets, and functions.\nIf we say, for example, “the probability that a roll of a fair six-sided die shows 3 or 4\nis1\n3,” we are actually interpreting the situation mathematically—the outcomes of the\ndie rolls are interpreted as the elements of the set {1,2,3,4,5,6}; the event that the die\nshows 3 or 4 is interpreted as the subset {3,4} ⊆ { 1,2,3,4,5,6}; and the probability\nthat this event occurs is the value of a particular function P:P({1,2,3,4,5,6})→[0,1]\non input {3,4}. The mathematical interpretation is called a model of the real-world\nsituation.\n436\nSection 11.1. Discrete probability spaces 437\n✦Definition 11.1.1\nAdiscrete probability space is a pair (Ω,P)(LATEX code:(\\Omega, \\mathbb{P}) ),\nconsisting of a countable set Ωand a function P:P(Ω)→[0,1], such that\n(i)P(Ω) =1; and\n(ii) ( Countable additivity ) If{Ai|i∈I}is any family of pairwise disjoint subsets\nofΩ, indexed by a countable set I, then\nP \n[\ni∈IAi!\n=∑\ni∈IP(Ai)\nThe set Ωis called the sample space ; the elements ω∈Ωare called outcomes ;athe\nsubsets A⊆Ωare called events ; and the function Pis called the probability measure .\nGiven an event A, the value P(A)is called the probability of A.\naThe symbols Ω,ω(LATEX code: \\Omega,\\omega ) are the upper- and lower-case forms, respectively, of the\nGreek letter omega .\nThere is a general notion of a probability space, which does not require the sample\nspace Ωto be countable. This definition is significantly more t",
  "Section 11.2: Discrete random variables": "Events in a probability space are sometimes unenlightening when looked at in isolation.\nFor example, suppose we roll a fair six-sided die twice. The outcomes are elements of\nthe set Ω={1,2,3,4,5,6}2, each occurring with equal probability1\n36. The event that\nthe die rolls sum to 7 is precisely the subset\n{(1,6),(2,5),(3,4),(4,3),(5,2),(6,1)} ⊆Ω\nand so we can say that the probability that the two rolls sum to 7 is\nP({(1,6),(2,5),(3,4),(4,3),(5,2),(6,1)}) =1\n6\nHowever, it is not at all clear from the expression {(1,6),(2,5),(3,4),(4,3),(5,2),(6,1)}\nthat, when we wrote it down, what we had in mind was the event that the sum of the\ndie rolls is 7. Moreover, the expression of the event in this way does not make it clear\nhow to generalise to other possible sums of die rolls.\nNote that the sum of the die rolls defines a function S:Ω→N, defined by\nS(a,b) =a+bfor all (a,b)∈Ω\nThe function Sallows us to express our event in a more enlightening way: indeed,\n{(1,6),(2,5),(3,4),(4,3),(5,2),(6,1)}={(a,b)∈Ω|a+b=7}=S−1[{7}]\n(Recall the definition of preimage in Definition 3.1.37.) Thus the probability that the\nsum of the two die rolls is 7 is equal to P(S−1[{7}]).\nIf we think of Snot as a function Ω→N, but as a N-valued random variable , which\nvaries according to a random outcome in Ω, then we can informally say\nP{S=7}=1\n6which formally means P(S−1[{7}]) =1\n6\nThis affords us much more generality. Indeed, we could ask what the probability is\nthat the die rolls sum to a value greater than or equal to 7. In this case, note that\nthe die rolls (a,b)sum to a number greater than or equal to 7 if and only if a+b∈\n{7,8,9,10,11,12}, which occurs if and only if (a,b)∈S−1[{7,8,9,10,11,12}]. Thus,\nwe might informally say\nP{S⩾7}=7\n12which formally means P(S−1[{7,8,9,10,11,12}]) =7\n12\n455\n456 Chapter 11. Discrete probability theory\nWe might also ask what the probability is that the sum of the die rolls is prime. In this\ncase, we might informally say\nP{Sis prime }=5\n12which formally means P(S−1[{2,3,5,7,11}]) =5\n12\nand so on. In each of these cases, we’re defining events—which are subsets of the\nsample space—in terms of conditions on the values of a random variable (which is,\nformally, a function).\nWe make the above intuition formal in Definition 11.2.1.\n✦Definition 11.2.1\nLet(Ω,P)be a probability space and let Ebe a set. An E-valued random variable on\n(Ω,P)is a function X:Ω→Esuch that the image\nX[Ω] ={X(ω)|ω∈Ω}\nis countable. The set Eis called the state space ofX. A random variable with countable\nstate space is called a discrete random variable .\nBefore we proceed with examples, some notation for events regarding values of random\nvariables will be particularly useful.\n✦Notation 11.2.2\nLet(Ω,P)be a probability space, let Ebe a set and let Xbe an E-valued random\nvariable on (Ω,P). For each e∈E, write\n{X=e}={ω∈Ω|X(ω) =e}=X−1[{e}]\nto denote the event that Xtakes the value e. More generally, for each logical formula\np(x)with free variable xranging over E, we write\n{p(X)}={ω∈Ω|p(X(ω))",
  "Section 12.1: Orders and lattices": "We saw in Section 5.1 how equivalence relations behave like ‘ =’, in the sense that they\nare reflexive, symmetric and transitive.\nThis section explores a new kind of relation which behaves like ‘ ⩽’. This kind of rela-\ntion proves to be extremely useful for making sense of mathematical structures, and has\npowerful applications throughout mathematics, computer science and even linguistics.\n✦Definition 12.1.1\nA relation Ron a set Xis apartial order ifRis reflexive, antisymmetric and transitive.\nThat is, if:\n• (Reflexivity) x R x for all x∈X;\n• (Antisymmetry) For all x,y∈X, ifx R y andy R x , then x=y;\n• (Transitivity) For all x,y,z∈X, ifx R y andy R z , then x R z .\nA set Xtogether with a partial order RonXis called a partially ordered set , orposet\nfor short, and is denoted (X,R).\nWhen we talk about partial orders, we usually use a suggestive symbol like ‘ ≼’ (LATEX\ncode:\\preceq ) or ‘⊑’ (LATEX code:\\sqsubseteq ).\n✐Example 12.1.2\nWe have seen many examples of posets so far:\n• Any of the sets N,Z,QorR, with the usual order relation ⩽.\n• Given a set X, its power set P(X)is partially ordered by ⊆. Indeed:\n⋄Reflexivity. IfU∈P(X)then U⊆U.\n⋄Antisymmetry. IfU,V∈P(X)with U⊆VandV⊆U, then U=Vby definition\nof set equality.\n⋄Transitivity. IfU,V,W∈P(X)with U⊆VandV⊆W, then U⊆Wby Proposi-\ntion 2.1.20.\n• The set Nof natural numbers is partially ordered by the divisibility relation—see\nExercises 5.1.23, 5.1.33 and 5.1.40. However, as noted in Exercise 5.1.33, the set Zof\nintegers is not partially ordered by divisibility, since divisibility is not antisymmetric\nonZ.\n474\nSection 12.1. Orders and lattices 475\n• Any set Xis partially ordered by its equality relation. This is called the discrete\norder onX.\n◁\nMuch like the difference between the relations ⩽and<onN, or between ⊆and⫋on\nP(X), every partial order can be strictified , in a precise sense outlined in the following\ndefinition and proposition.\n✦Definition 12.1.3\nA relation Ron a set Xis astrict partial order if it is irreflexive, asymmetric and\ntransitive. That is, if:\n• (Irreflexivity) ¬(x R x)for all x∈X;\n• (Asymmetry) For all x,y∈X, ifx R y , then¬(y R x);\n• (Transitivity) For all x,y,z∈X, ifx R y andy R z , then x R z .\n✣Proposition 12.1.4\nLetXbe a set. Partial orders ≼onXare in natural correspondence with strict partial\norders ≺onX, according to the rule:\nx≼y⇔(x≺y∨x=y)and x≺y⇔(x≼y∧x̸=y)\nProof\nLetPbe the set of all partial orders on Xand let Sbe the set of all strict partial orders\nonX. Define functions\nf:P→Sand g:S→P\nas in the statement of the proposition, namely:\n• Given a partial order ≼, letf(≼)be the relation ≺defined for x,y∈Xby letting x≺y\nbe true if and only if x≼yandx̸=y;\n• Given a strict partial order ≺, letg(≺)be the relation ≼defined for x,y∈Xby letting\nx≼ybe true if and only if x≺yorx=y.\nWe’ll prove that fandgare mutually inverse functions. Indeed:\n•fis well-defined. To see this, fix ≼and≺=f(≼)and note that:\n⋄ ≺ is irreflexive, since for x∈Xifx≺xthen x̸=x, which is a contradiction.\n⋄ ≺ is asymme",
  "Section 12.2: Inductively defined sets": "In Section 4.1, we formalised the idea that the set of natural numbers should be what is\nobtained by starting with zero and repeating the successor (‘plus one’) operation—this\nwas done using Peano’s axioms (Definition 4.1.1). From these axioms we were able\nto derive the weak and strong induction principles, which turned out to be extremely\npowerful for proving results about natural numbers.\nWe now generalise this idea to other so-called inductively defined sets. The definition\n(Definition 12.2.9) is a little tricky to digest, but the idea is relatively simple: an induct-\nively defined set Xis one whose elements are built out of some specified basic elements\n(such as 0) by iterating some specified operations, called constructors (such as the suc-\ncessor operation)—every element of Xshould either be a basic element, or should be\nbuilt in a unique way out of simpler elements of Xby using a constructor.\nEach inductively defined set Xwill have its own induction principle: which says that if\na property is true of all of the basic elements of X, and if all of its constructors preserve\nthe truth of the property, then the property is true of all of the elements of X. We will\nprove this in Theorem 12.2.28.\nBefore jumping into the definition of an inductively defined set, it is helpful to see some\nexamples. The first example is familiar.\n✐Example 12.2.1\nThe set Nof natural numbers is thecanonical example of an inductively defined set.\nThe Peano axioms (Definition 4.1.1) tell us that every element of Ncan be obtained by\nstarting from 0 and applying the successor operation (‘plus one’) some finite number\nof times. In particular, every natural number is either 0, or is the successor of a unique\nnatural number.\nWe can think of Nas being the set generated by the following rules:\n(i) 0∈N; and\n(ii) If n∈N, then n+1∈N.\nCertainly these rules are true, but that is not enough to fully characterise the set of\nnatural numbers: both rules are also true with Nreplaced by ZorR, for example.\nBut what it means to say that Nis ‘generated by’ these rules is that:\n• Each time one of the rules is applied, we obtain a newnatural number. In particular:\n486\nSection 12.2. Inductively defined sets 487\n⋄Since 0 ∈Nand rule (ii) must give us a new natural number every time we apply\nit, we must have n+1̸=0 for all n∈N. This is exactly what Definition 4.1.1(i)\nsays; note that this fails with Nreplaced by ZorRsince we have (−1)+1=0.\n⋄If we apply rule (ii) to two different natural numbers, we must obtain two different\nresults. Thus for all m,n∈N, ifm+1=n+1, then m=n. This is exactly what\nDefinition 4.1.1(ii) says.\n• Only those things that can be obtained by applying rules (i) and (ii) some finite num-\nber of times are natural numbers. This is exactly what Definition 4.1.1(iii) says.\nThus we can think of the natural numbers as being precisely those things that are given\nto us by applying rules (i) and (ii). ◁\nThe next example concerns words over an alphabet, which we studied in Section 6.2 i"
}